[
  {
    "product_code": "T-245",
    "name": "Ghost Lamp",
    "description": "A spectator selects a card, which is then lost in the deck. The deck is divided into several piles. A light bulb, wrapped in a handkerchief, is waved over the piles and magically illuminates over one of them. The top card of that pile is revealed to be the spectator's chosen card. The light from the bulb is then extinguished by the magician pretending to cut an invisible wire.",
    "year_released": "2010",
    "creator": "Scotty York",
    "popularity_score": 8,
    "rarity_score": 9,
    "combined_score": 8.5,
    "image_filename": "T-245_Ghost_Lamp.jpg",
    "reviews": [
      "'I really like Tenyo's Ghost Lamp, as the mechanism used seems to work flawlessly and the light bulb is fairly bright and easy to see...This is certainly one of the best that Tenyo has put out in some time, and the electronics and thought that went into this effect have created a trick that is nearly self working and would a be fun at any dinner party.' - Saysold1 on Magic Café",
      "'The trick itself is good. Lengthy, but good. It depends on the medium of magic that you wish to perform for. Impromptu? Get away from ‘Ghost Lamp’. You do close-up shows? Go right after it.' - Tower of Lunatic Meat on theory11 forums",
      "'I've used this to create one of my strongest routines to date, well made & practical, 10/10' - Ben on Vanishing Inc. Magic"
    ],
    "consensus": "The general consensus is that the Tenyo Ghost Lamp is a well-made and effective trick, particularly for close-up performances. It is considered a strong routine rather than a quick trick, but it is not ideal for impromptu situations and can be expensive."
  },
  {
    "product_code": "T-226",
    "name": "President's Cabinet",
    "description": "A dollar bill is placed in a small frame, and the president's face is visible through a hole. The magician then slides the hole down, and the president's head seemingly moves with it, detaching from the bill. The head is then slid back into place, and the bill is removed and shown to be perfectly normal.",
    "year_released": "2006",
    "creator": "Shigeru Sugawara",
    "popularity_score": 8,
    "rarity_score": 9,
    "combined_score": 8.5,
    "image_filename": "T-226_President's_Cabinet.jpg",
    "reviews": [
      "'Perhaps not the most baffling illusion but it works pretty well for laymen.' - Tenyo Magic Forum user",
      "'Very easy to do and solid, good quality props. With the right story told (George the Magician!), this is a great trick to own. One of my favorites.' - tenyo-magic.blogspot.com review",
      "'One of my all time favorite Tenyo releases. So incredibly fooling. I love this one.' - YouTube commenter"
    ],
    "consensus": "The general consensus is that the trick is clever, easy to perform, and well-made, making it a favorite among collectors and hobbyists, though it may not be suitable for professional magicians."
  },
  {
    "product_code": "T-181",
    "name": "Bird Watcher",
    "description": "The magician demonstrates an uncanny ability to count the number of birds on several picture cards, even when their back is turned. A spectator arranges the cards, and the magician can instantly and accurately state the total number of birds. The routine can be performed twice with different methods, becoming more baffling each time, with the final reveal happening while the cards are inside a sealed case.",
    "year_released": "1997",
    "creator": "Tomoyuki Shimomura",
    "popularity_score": 9,
    "rarity_score": 8,
    "combined_score": 8.5,
    "image_filename": "T-181_Bird_Watcher.jpg",
    "reviews": [
      "'This one is \\'superior\\'! Easy to do, lengthy routine which gets more baffling each step and the last reveal with the cards in the box make this a true miracle.' - David DeTenyo, Tenyo Magic Forum",
      "'The prop was really beautifully made. The 1st method is clever, the 2nd one is even better. It`s just perfect !' - VictorS, Tenyo Magic Forum",
      "'T -181 Bird Watcher is a popular ESP/Mentalism type effect...The trick is examinable and the props are well crafted with graphics that remind those that are found in books on ornithology...It features a logical story...and fully repeatable.' - Glenn Duncan, tenyo-magic.blogspot.com"
    ],
    "consensus": "The general consensus for Tenyo's T-181 Bird Watcher is overwhelmingly positive. It is praised for its clever dual-method, high-quality props, and engaging presentation, with many collectors and performers considering it a top-tier and classic Tenyo effect."
  },
  {
    "product_code": "T-148",
    "name": "Mira-Metal",
    "description": "An obviously solid sheet of metal is placed into an open holder. The window cover is closed, the case snapped, and a real quarter falls out of the metal to the table. The metal now has a coin sized hole right through its center! And at the end of the trick, everything can be handed out for examination.",
    "year_released": "1990",
    "creator": "Atsushi Fukano",
    "popularity_score": 8,
    "rarity_score": 9,
    "combined_score": 8.5,
    "image_filename": "T-148_Mira-Metal.jpg",
    "reviews": [
      "'I find this to be one of those little ingenious little tricks from the good old days ... . A quick trick, yes, but a really good one.' - David DeTenyo, Tenyo Magic Forum",
      "'It's one of those tricks which reminds me of how clever Tenyo items are.' - BluBob, Tenyo Magic Forum",
      "'A very nice trick I particularly like because of its simplicity, however, generates a large impact on the public. The idea is really good and taking care of the presentation you can really ensure that nobody can understand how the coin appeared...' - tenyo-magic.blogspot.com"
    ],
    "consensus": "The general consensus is that Mira-Metal is a clever, simple, and impactful trick. The props are well-made and the fact that they can be examined at the end is a big plus. Some magicians note that the handling requires some practice to be smooth and that the case might draw suspicion if not handled properly."
  },
  {
    "product_code": "T-131",
    "name": "The Moons Of Jupiter",
    "description": "A red disk is inserted into a handsome case and it magically changes color to yellow, then back to red, on both sides! Then it changes to blue on both sides, almost instantaneously, to green. This is a handsome prop, and introduces a clever principle that, you’ll learn the easy sequence, make the trick self-working. The disk is large and the bright colors, and a result, this magic trick is suitable for close-up, parlor or stage.",
    "year_released": "1987",
    "creator": "Hideo Kato",
    "popularity_score": 8,
    "rarity_score": 9,
    "combined_score": 8.5,
    "image_filename": "T-131_The_Moons_Of_Jupiter.jpg",
    "reviews": [
      "'I'm giving this a 'superior' rating (9/10). It is baffling and quite easy to do. The props are very colorfull and will draw attention of your spectators. The routine makes sense. All in all a must have for every magic collector.' - David DeTenyo, Tenyo Magic Forum",
      "'This is a handsome prop, and introduces a clever principle that, once you learn the easy sequence, make the trick self-working. The disk is large and the colors bright, and as a result, this magic trick is suitable for close-up, parlor or stage.' - Tenyo Fan Blog",
      "'I like this one a lot.....very clever...a very unusual and intricate gimmick.' - Roberto B., Tenyo Magic Forum"
    ],
    "consensus": "The general consensus is that \"The Moons of Jupiter\" is a highly-regarded and visually appealing magic trick. It is considered clever, well-designed, and suitable for a variety of performance settings, from close-up to stage."
  },
  {
    "product_code": "T-238",
    "name": "Floating Card",
    "description": "A selected card mysteriously floats upward from the deck, right in front of the spectator's eyes. The card can be shown to be suspended in mid-air, and then slowly returns to the deck. The deck can be immediately spread to show the faces of all the cards.",
    "year_released": "2009",
    "creator": "Angelo Carbone",
    "popularity_score": 7,
    "rarity_score": 8,
    "combined_score": 7.5,
    "image_filename": "T-238_Floating_Card.png",
    "reviews": [
      "'Floating Card has exceeded my expectations in terms of ease of presentation and strong visual impact.' - Tenyo Magic Blogspot",
      "'What I like about doing it this way is that it appears the the magician is not touching the deck at all when the card starts floating.' - Xl18 on Magic Café Forum",
      "'This is one of Tenyo's best. Carbone is a genius, and this thing looks like real magic.' - Bill on Vanishing Inc. Magic"
    ],
    "consensus": "The general consensus is that the Tenyo T-238 Floating Card is a visually stunning and easy-to-perform magic trick. Reviewers praise its clever gimmick, which allows for a clean and impressive presentation."
  },
  {
    "product_code": "T-223",
    "name": "Origami Tube",
    "description": "The magician inserts a dollar bill into the Origami Tube. Seconds later, both the bill and the tube shrink in size in a mysterious and inexplicable way. The magician inserts four solid cards into the middle of the tube - where the bill's center is supposed to be. However, the cards completely slice through the tube. It appears that the bill must have been cut in half. However, after removing the cards, the magician removes the dollar bill - completely unharmed and intact.",
    "year_released": "2005",
    "creator": "Toru Suzuki",
    "popularity_score": 7,
    "rarity_score": 8,
    "combined_score": 7.5,
    "image_filename": "T-223_Origami_Tube.jpg",
    "reviews": [
      "'The effect for this trick is outstanding. I did not expect it to have such a great reaction until I performed it to my friends at a birthday party. You will get the 'Oh my god' reaction. The effect of this trick is just like those professional illusion show where a woman is chop into half and restored. The price is cheap to have such a great effect. The workmanship of the gimmick is good and can be performed surrounded.' - Zhi Xiang Tan, seomagic-usa.com reviewer",
      "'The tube itself is nicely decorated thereby presenting the props as something mysterious or exotic, besides, I suggest you find an old bank note to a distant country to enhance the story you tell when you perform this trick.. You will find a banknote with a good length without being too wide for the trick goes well. This effect is more an enigma than a magical effect, but the construction of gimmick is interesting.' - tenyo-magic.blogspot.com reviewer",
      "'Excellent idea! I like Origami Tube, but it's a bit too much like a puzzle for me - and I'm trying to come up with something different for it. But this might be it. I'm not using the plates included in the set, I use playing cards instead - and right now I'm just down to one playing card because it looks less messy.' - FredA, Tenyo Magic Forum member"
    ],
    "consensus": "The general consensus is that Tenyo's Origami Tube is a visually impressive trick with a well-made prop that gets strong reactions from audiences. However, some magicians feel it is more like a puzzle than a true magic effect."
  },
  {
    "product_code": "T-211",
    "name": "Fadeaway Case",
    "description": "After inserting a dollar bill or credit card into a case, the magician makes a magical gesture that causes the bill to visibly fade from view until it is completely gone. The slow vanish is visually shocking, and will make audiences feel as if they are watching a movie special effect. You can also insert a borrowed credit card into the case. The credit card visibly fades from view and vanishes completely.",
    "year_released": "2003",
    "creator": "Toru Suzuki",
    "popularity_score": 6,
    "rarity_score": 9,
    "combined_score": 7.5,
    "image_filename": "T-211_Fadeaway_Case.jpeg",
    "reviews": [
      "'To conclude I think Fadeaway Case is a really interesting effect that you would be wrong to leave aside. Do not stop to the included routine with the bill because this little box has more than one trick up his sleeve. I think it's a nice curiosity that you will enjoy a show to your friends or leave on your desktop but it's also an utility device that you can incorporate into your repertoire.' - tenyo-magic.blogspot.com",
      "'This slow vanish is visually shocking, and will make audiences feel as if they are watching a movie special effect.' - SEO MAGIC USA",
      "'On peut faire beaucoup plus de routines avec Fadewaycase.' (translation: 'We can do many more routines with Fadeaway Case.') - Anonymous commenter on tenyo-magic.blogspot.com"
    ],
    "consensus": "The Fadeaway Case is a visually impressive trick with a clever mechanism, but it is not as popular as other Tenyo tricks. The effect is considered more of an optical illusion than a magic trick, and it may not be as engaging for audiences. However, with some creativity, it can be used as a utility device for other routines."
  },
  {
    "product_code": "T-152",
    "name": "Nostradamus Clock",
    "description": "The magician exhibits a small clock in a box. Any spectator is asked to think of any time of day, but not tell anyone. The magician sets the clock at an hour, places the clock in the box and replaces the lid. Only now is the spectator asked to name the time he is thinking of. When the lid is removed from the box the audience sees that the magician has exactly predicted the hour.",
    "year_released": "1991",
    "creator": "Tomoyuki Shimomura",
    "popularity_score": 7,
    "rarity_score": 8,
    "combined_score": 7.5,
    "image_filename": "T-152_Nostradamus_Clock.jpg",
    "reviews": [
      "'This is one of Tenyo's lesser effective tricks...it is a minor loss to put it straight away in the junk drawer.' - Penguin Magic reviewer",
      "'It’s ok. It’s essentially a knock off of a really great Tenyo effect called the Nostradamus clock. Except it lacks the clever Tenyo gimmick, which I believe is probably copyrighted. So essentially what you’re buying is a color cube/color vision box. Still pretty cool though with the clock feature.' - Vanishing Inc. Magic reviewer",
      "'First the pros: The trick is smart and deceptive in how it works though I already had an idea and wa.. Rating: 3 of 5 Stars! [3 of 5 Stars!]' - SEO Magic USA reviewer"
    ],
    "consensus": "The general consensus on the Tenyo Nostradamus Clock is that it is a clever and deceptive trick, but some find the props to be of lower quality than expected. It is considered a good trick for beginners to practice their presentation skills."
  },
  {
    "product_code": "T-127",
    "name": "Telesphere",
    "description": "The magician displays three crystal vials, two covers, and three balls. The balls mysteriously jump from vial to vial, and from the magician's pockets to the vials. In a spooky sequence, a ball penetrates through the bottom of the vial.",
    "year_released": "1986",
    "creator": "Hiroshi Kondo",
    "popularity_score": 7,
    "rarity_score": 8,
    "combined_score": 7.5,
    "image_filename": "T-127_Telesphere.jpg",
    "reviews": [
      "'Quality of the props is remarquable, the bottom of the crystal vials are heavy as if they were metal and they are very well in hand. Both covers its soft rubber with a velvet effect, they can be examined without problem... The mechanism used here is really ingenious, Tenyo has succeeded to adapt a classic of magic... Great stuff !' - Tenyo Magic Blogspot",
      "'For me, this is certainly one of the best Tenyos of all time...period. What more can I say?' - Steve S., Tenyo Magic Forum",
      "'Wow! Amazing! Magical!' - Jeremy Pei, YouTube"
    ],
    "consensus": "The general consensus is that Tenyo's T-127 Telesphere is a very clever and well-made trick with high-quality props and an ingenious method. It is considered impressive by both laymen and magicians, and is often cited as one of the best Tenyo tricks ever produced."
  },
  {
    "product_code": "T-93",
    "name": "Card Changer",
    "description": "A playing card is dropped through a slatted chamber and visibly transforms into a different card as it falls out the other end. The change is instantaneous and happens in plain sight, creating a startling and visual piece of magic.",
    "year_released": "1978",
    "creator": "Shigeru Sugawara",
    "popularity_score": 7,
    "rarity_score": 8,
    "combined_score": 7.5,
    "image_filename": "T-93_Card_Changer.webp",
    "reviews": [
      "'I love this thing. It’s so versatile. I’ve seen some complaint about it being moody, but I’ve found with a consistent speedy/slightly forceful push, it works beautifully every time. And the optical illusion involved is hard to beat. One of my favorites in my collection.' - Tenyo Magic Forum user",
      "'Wow loads of possibilities! And this Tenyo looks sooo amazing! And yellow is my favorite color :-) I don't have this one but it's on my wish list now! Thanks for your very informative video!' - YouTube user @brotherbor",
      "'A Joker is shown and remains in view of the spectators through the slits in the plastic case as it travels down the length of the Card Changer. But the card that drops out of the opposite end has been changed into a card that had been chosen earlier by a spectator! Everything is done automatically requiring no sleight of hand.' - Tenyo Magic Blog"
    ],
    "consensus": "The Tenyo T-93 Card Changer is generally well-received as a visually impressive and versatile magic trick. While some users note that it can be finicky and requires practice to master the handling, it is praised for its clever optical illusion and the fact that it is self-working, requiring no sleight of hand."
  },
  {
    "product_code": "T-81",
    "name": "Space Walking Coins",
    "description": "A holder with five coins is opened and four of the coins are removed and placed into a stand. One by one the coins are taken off the stand only to appear back inside the clear holder.",
    "year_released": "1976",
    "creator": "Shigeru Sugawara",
    "popularity_score": 7,
    "rarity_score": 8,
    "combined_score": 7.5,
    "image_filename": "T-81_Space_Walking_Coins.jpg",
    "reviews": [
      "'The first one that pops to mind is Space Walking Coin(s). When I read the discription it sounded incredible. When I received it, opened my package and read the discription I immediately had a feeling like: \\'I\\'m never going to perform this\\'. While this isn\\`t a bad trick per se, it just isn\\`t my cup of tea.' - David DeTenyo on Tenyo Magic Forum",
      "'Effect : 8/10, Design : 8/10, Quality and finish : Good' - tenyo-magic.blogspot.com",
      "'A holder with five coins is opened and four of the coins are removed and placed into a stand. One by one the coins are taken off the stand only to appear back inside the clear holder.' - Magic Collectibles"
    ],
    "consensus": "The trick is generally well-regarded for its effect and design, but some find it not to their personal taste for performance. It's a collector's item that can fetch a high price."
  },
  {
    "product_code": "T-136",
    "name": "Geometrick",
    "description": "The magician brings out a solid screen containing a square-shaped hole, as well as a square block, which is dropped through the hole. The screen is placed into a case where the ends of the screen remain visible at all times. A magic pass is made and the screen is removed. But now the square hole has been replaced by a circular hole through which the square block absolutely will not pass. The procedure is reversed and the hole once again becomes square shaped.",
    "year_released": "1988",
    "creator": "Hideo Kato",
    "popularity_score": 8.5,
    "rarity_score": 6,
    "combined_score": 7.25,
    "image_filename": "T-136_Geometrick.jpg",
    "reviews": [
      "'A classic and quite rare Tenyo effect. It is brilliant and oh so fooling.' - Presenting Tenyo (YouTube)",
      "'I think Tenyo magic is seriously underrated. The effects and methods of Tenyo tricks are far original/diabolical/ingenious than some of the non Tenyo tricks on the market.' - The Genii Forum",
      "'The magician brings out a solid screen containing a square-shaped hole, as well as a square block, which is dropped through the hole. The screen is placed into a case where the ends of the screen remain visible at all times. A magic pass is made and the screen is removed. But now the square hole has been replaced by a circular hole through which the square block absolutely will not pass. The procedure is reversed and the hole once agin becomes square shaped. The screen always remains at least partially in view. Yet it changes its solid shape ! Can it really be only an illusion ? Is it just a smoke screen ?' - Tenyo Magic Fan Blog"
    ],
    "consensus": "Tenyo's Geometrick is a highly regarded and clever magic trick. It is considered a classic and is praised for its ingenuity and fooling effect. While some may dismiss Tenyo tricks as 'plastic toys,' many appreciate the high quality and intricate mechanisms of their products."
  },
  {
    "product_code": "T-200",
    "name": "Undercover Cube",
    "description": "Display a cube, a transparent box, an empty cup and a handkerchief to your audience. A spectator reaches under the handkerchief to place the cube into the box, and the box is placed on top of the cup. When the handkerchief is removed, the cube has vanished from the box and magically reappears inside the cup.",
    "year_released": "2001",
    "creator": "Petrick & Mia",
    "popularity_score": 6,
    "rarity_score": 8,
    "combined_score": 7.0,
    "image_filename": "T-200_Undercover_Cube.jpg",
    "reviews": [
      "'It's not BAD. It's just that the initial routine in the instructions are rather flat. And that gives the trick less appeal. I believe that you can do 3 types of effects with it: penetration (using a cup), vanish, and color change.' - Tenyo Magic Forum user",
      "'The cube and the box are sturdy plastic. Considering that ‘Undercover Cube’ doesn’t pop up for sale or trade, like, EVER. AND that I paid a hefty chunk of change to acquire this one; I can assure you that I’m not exactly going to be ready to test the limits of their sturdiness.' - theory11 forums user",
      "'There are no words to describe the shock your audience will feel when the cube that they placed into the box themselves has disappeared!' - SEO MAGIC product description"
    ],
    "consensus": "The general consensus is that the trick has potential but requires a good presentation to be effective. The original routine is considered weak, but with some creativity, it can be a strong piece of magic. The props are well-made, but the trick is rare and expensive."
  },
  {
    "product_code": "T-195",
    "name": "Grand Derby Prediction",
    "description": "A spectator shuffles eight cards, each showing a racehorse and numbered from 1 through 8. The performer then mixes the cards further, according to the spectator's directions. The performer predicts the order of the racehorses on a piece of paper, and accurately indicates the order the first and second-place horses. In addition, there is a further prediction at the bottom of the prediction paper, which accurately predicts the exact order of horses 3 through 8.",
    "year_released": "1999",
    "creator": "Tomoyuki Shimomura",
    "popularity_score": 6,
    "rarity_score": 8,
    "combined_score": 7.0,
    "image_filename": "T-195_Grand_Derby_Prediction.jpg",
    "reviews": [
      "'Waouh ! J'avais du mal à y croire en lisant les explications mais ça marche bien ! Très bon tour, bien différent des classiques de tenyo' - Goemind, Tenyo Magic Blog",
      "'A VERY DECEPTIVE AND CLEVER MAGIC TRICK FROM TENYO - ONE OF MY FAVOURITES!!!' - Worthpoint Reviewer",
      "'The performer predicts the order of the racehorses on a piece of paper, and accurately indicates the order the first and second-place horses. In addition, there is a further prediction at the bottom of the prediction paper, which accurately predicts the exact order of horses 3 through 8.' - Quicker than the Eye"
    ],
    "consensus": "The general consensus is that Tenyo's Grand Derby Prediction is a very clever and deceptive trick. It is well-regarded for its originality and effectiveness, with reviewers noting that it is different from typical Tenyo tricks and highly effective."
  },
  {
    "product_code": "T-147",
    "name": "Silver Express",
    "description": "The magician displays four quarters and two empty Silver Express towers. The four quarters are stacked and covered with one of the towers. The other tower is placed some distance away. Magically, one of the quarters flies from the stack over to the empty tower – and your spectators can hear it arrive. This is repeated until all four coins have flown from one tower to the other.",
    "year_released": "1990",
    "creator": "Keiji Takahashi",
    "popularity_score": 6,
    "rarity_score": 8,
    "combined_score": 7.0,
    "image_filename": "T-147_Silver_Express.jpg",
    "reviews": [
      "'No magnets involved here...thats the beauty of this trick...the method is very unique.' - YouTube user @MagicPatagonia",
      "'Wow! was this the forerunner to flying coins? I didn't realize it was a tenyo effect! Great videos' - YouTube user @stevietrixta",
      "'Very smooth performance.' - YouTube user @rorycoker6601"
    ],
    "consensus": "The general consensus for Tenyo's Silver Express is that it is a clever and visual trick with a unique method that does not use magnets. It is considered a forerunner to the \"flying coins\" plot and is praised for its smooth operation. However, the US version of the trick had some issues with the precision of the props and the size of American coins."
  },
  {
    "product_code": "T-122",
    "name": "Excalibur",
    "description": "Four metal slugs are inserted into a holder which is then inserted into a case. A miniature sword is inserted into one end of the case and slices straight through all four coins. When the holder is removed, the coins have now magically changed to four american quarters.",
    "year_released": "1985",
    "creator": "Shigeru Sugawara",
    "popularity_score": 6,
    "rarity_score": 8,
    "combined_score": 7.0,
    "image_filename": "T-122_Excalibur.jpg",
    "reviews": [
      "'Unfortunately, although the effect is really successful, the build quality is pretty bad and a lot of magician just can not perform the trick because it does not work properly.' - tenyo-magic.blogspot.com",
      "'This prop is not so practical to be performed because it has obvious problem with the sound and probably people has no confidence to perform it.' - funstuffonly.com forum user",
      "'Excalibur works best with brand new quarters, not worn quarters.' - Genii Forum user"
    ],
    "consensus": "The general consensus is that Tenyo's Excalibur is an ingenious trick with a great effect, but it suffers from manufacturing flaws that make it unreliable and difficult to perform consistently. Many users report issues with the mechanism and sound, though some offer tips to improve its performance."
  },
  {
    "product_code": "T-204",
    "name": "Escape King",
    "description": "The magician inserts a card with a hole through its center into a folder, and then passes a ribbon through the hole. After closing the folder, the card magically escapes from within the confines of the case. As a follow-up effect, the card penetrates on and off of the ribbon with ease. All props can be passed out for examination.",
    "year_released": "2002",
    "creator": "Takayuki Kumazawa",
    "popularity_score": 6,
    "rarity_score": 7,
    "combined_score": 6.5,
    "image_filename": "T-204_Escape_King.jpg",
    "reviews": [
      "'I really like this effect. It's easy to do and for most people this is pretty baffling. There's a litle gimmicked thing envolved which makes the effect work, so clever ... . In this trick the use of ordinary black plastic also makes sense, other matreials could arouse suspicion. One of those Tenyo effects where you only need one, this will last a lifetime if you handle it as it should.' - David DeTenyo, Tenyo Magic Forum",
      "'This trick leaves a mixed impression because despite the fact that the props is well designed and well made, the effect really does not impress. To be clear this effect will be successful only in the hands of a skilled magician able to sublimate the trick through movement perfectly smooth and under control. It is imperative to present this trick with gentleness and simplicity so that every gesture seem as natural as possible to remove any doubt in the sequence of manipulations. Because if these handling are not well executed, the audience will immediately understand the trick that allows the playing card to escape. So here there is no particular mechanism and this may be what disappoint Tenyo fans. Despite all the best magician may find an interest with \"Escape King\" if they are able to master the effect and present it in a poetic way.' - tenyo-magic.blogspot.com",
      "'All props can be passed out for examination. The folder appears to be completely ungimmicked, but its clever construction contains a secret. The small props easily fit in your pocket, enabling you to perform escape magic right in front of your audience's eyes. This trick is divided into two parts, and is designed to become more and more impossible in each phase.' - SEO MAGIC"
    ],
    "consensus": "The general consensus on \"T-204 Escape King\" is that it is a cleverly designed and well-made trick with props that can be examined. However, its effectiveness is highly dependent on the performer's skill, as poor handling can easily expose the method."
  },
  {
    "product_code": "T-189",
    "name": "Money Shredder",
    "description": "You insert a borrowed bill and a sheet of white paper into a clear case. You then tear them both in half using a length of string. The paper is still torn into pieces, but the bill is unharmed! The case is exactly the same size as a dollar bill. It is also transparent, so there is nowhere for the bill to escape.",
    "year_released": "1999",
    "creator": "Shigeru Sugawara",
    "popularity_score": 6,
    "rarity_score": 7,
    "combined_score": 6.5,
    "image_filename": "T-189_Money_Shredder.jpg",
    "reviews": [
      "'You insert a borrowed bill and a sheet of white paper into a clear case. You then tear them both in half using a length of string. The paper is still torn into pieces, but the bill is unharmed! The case is exactly the same size as a dollar bill. It is also transparent, so there is nowhere for the bill to escape.' - tenyo-magic.blogspot.com",
      "'Money Shredder is a problem I'm trying to solve now: it should work beautifully, but the string coming around the bill should not be obvious. When most people do it, it's plain as day, and thus there is no magical effect.' - Genii Forum member",
      "'This magic effect has a strong impact on audiences because it appears that you are tearing up a borrowed bill. This is thoroughly baffling trick.' - SEO MAGIC"
    ],
    "consensus": "The Tenyo Money Shredder is a visually appealing trick with a strong effect on the audience, as it appears a borrowed bill is destroyed and then restored. However, some magicians find the method difficult to perform convincingly, as the secret action can be too obvious to the audience, diminishing the magical effect."
  },
  {
    "product_code": "T-175",
    "name": "The Unusual Suspects",
    "description": "In this puzzling magic trick, the audience is invited to participate in a police line-up and help solve the crime. A number of suspect cards are shown, illustrating various criminal characters, and one is secretly chosen by a spectator to be the thief. The cards are mixed up and placed in the magic Profiler, which the magician explains is a space-age computer device used to catch criminals. The spectator enters some data about the criminal into the magic Profiler which amazingly identifies the correct suspect.",
    "year_released": "1996",
    "creator": "Tomoyuki Shimomura",
    "popularity_score": 6,
    "rarity_score": 7,
    "combined_score": 6.5,
    "image_filename": "T-175_The_Unusual_Suspects.jpg",
    "reviews": [
      "'This is an effect that is often overlooked but I love it. It is so easy to do and you can really focus on the story.' - David DeTenyo, Tenyo Magic Forum",
      "'I've always had a soft spot for US, it's a shame tenyo didn't stretch to beeping buttons (and the symbols are a bit random) but it's charming in its slight oddness.' - SimonC, Tenyo Magic Forum",
      "'What I like most about this one is that you tell a story rather than just do a fast magic trick.' - Steve S., Tenyo Magic Forum"
    ],
    "consensus": "The general consensus is that \"Unusual Suspect\" is an underrated and charming trick that is easy to perform, allowing the magician to focus on the storytelling aspect of the routine. While some find the props slightly odd, the overall effect is well-loved for its engaging narrative."
  },
  {
    "product_code": "T-142",
    "name": "Lancelot",
    "description": "A bill is placed into a plastic case and placed into a decorated box. A sword is placed through all. When the bill is removed, the bill is found to be unscathed.",
    "year_released": "1989",
    "creator": "Hiroshi Kondo",
    "popularity_score": 7,
    "rarity_score": 6,
    "combined_score": 6.5,
    "image_filename": "T-142_Lancelot.jpg",
    "reviews": [
      "'I really like this one. I think it's deceptive in its simplicity. I like that the props actually aren't mechanical in nature.' - MadisonPresents, Tenyo Magic Forum",
      "'It's the tiny sword that does it for me it's rare to see metal in a Tenyo trick now!' - SimonC, Tenyo Magic Forum",
      "'A great penetration effect from Tenyo! One that fooled me very badly until I read the instructions.' - Presenting Tenyo, YouTube"
    ],
    "consensus": "The general consensus for Tenyo's Lancelot (T-142) is that it is a clever and deceptive trick, with its simplicity being one of its strengths. Many appreciate the use of a metal sword, a departure from typical Tenyo props, though some collectors do not consider it a top favorite."
  },
  {
    "product_code": "T-123",
    "name": "Billscape",
    "description": "A borrowed signed bill is trapped between two plates by rubber bands. The spectator can assist in locking up the bill. The whole package is placed in a handsome case and the magician thrusts a needle through the case. It impales the signed bill and pulls it free of its prison. The plates and the case are empty. As a special bonus, this trick includes instructions for a second trick where a credit card magically switches place with a signed bill.",
    "year_released": "1986",
    "creator": "Hiroshi Kondo",
    "popularity_score": 6,
    "rarity_score": 7,
    "combined_score": 6.5,
    "image_filename": "T-123_Billscape.jpg",
    "reviews": [
      "'Easily one of Tenyo's all time best creations. This fooled me very very badly the first time I saw it.' - YouTube user",
      "'love this trick, Classic tenyo thinking, stripped down to an elegant design, a great idea backed up by a well thought out routine.' - Tenyo Magic Forum member",
      "'This trick is certainly the most successful of all the collection, the effect is really amazing for a bills routine.' - tenyo-magic.blogspot.com review"
    ],
    "consensus": "The general consensus is that Billscape is a highly regarded and classic Tenyo trick. It is praised for its cleverness, elegant design, and strong effect, with many considering it one of Tenyo's best creations."
  },
  {
    "product_code": "T-106",
    "name": "Ribbon Forever",
    "description": "A regular ungimmicked ribbon is placed into a beautiful decorated plastic holder. The front of the holder has a cut out window enabling the spectator to actually see the ribbon at all time. The magician cuts the ribbon into two separate pieces. Now, while all eyes are on the ribbon the magician pulls it out of its holder and it magically restores itself.",
    "year_released": "1981",
    "creator": "Keiji Takahashi",
    "popularity_score": 6,
    "rarity_score": 7,
    "combined_score": 6.5,
    "image_filename": "T-106_Ribbon_Forever.jpg",
    "reviews": [
      "'I like the thinking behind this trick but I've never been able to perform it properly as in the instructions. When pulling the ribbon i find it tends to slide around a lot throwing off the illusion. The timing also has to be exact. Perhaps with enough practice I could have gotten it working right but I think it would have benefited from having some sort of guides for the ribbon.' - Elliot W., Tenyo Magic Forum",
      "'If you do it as shown in the video, it works quite well - a very clever trick principle ! A tremendously effective deception precisely because of his inconspicuousness design' - Olaf S, Tenyo Magic Forum",
      "'Doing it as in the video is not easy! I remember Roberto (who performs in the video) telling us he had to go to the store to buy extra ribbon because it took him A LOT of try outs before it worked smoothly. I agree with Elliot - it's a very clever principle and if it works it's quite baffling, but it's a bit hit or miss when performing, at least for me. A great collector item, but not something most of us will perform very often I think.' - David DeTenyo, Tenyo Magic Forum"
    ],
    "consensus": "The general consensus is that Tenyo's Ribbon Forever is a clever and baffling trick in principle, but it is difficult to perform smoothly and consistently. While some users have had success with practice, many find it to be a 'hit or miss' effect that is more of a collector's item than a practical performance piece."
  },
  {
    "product_code": "T-102",
    "name": "Lucifer's Lock",
    "description": "A cord having solid plastic stoppers at the ends and a regular padlock are passed out for examination. The spectator secures the lock onto the cord, and once secured, the lock cannot pass over the end stoppers. Without covering the lock in any way and in full view, it simply melts off the cord and all may be examined.",
    "year_released": "1980",
    "creator": "Shigeru Sugawara",
    "popularity_score": 4,
    "rarity_score": 9,
    "combined_score": 6.5,
    "image_filename": "T-102_Lucifer's_Lock.jpg",
    "reviews": [
      "'Wow- this is lovely! Really beautifully done and lives up to the description on the back of the package!! I especially like the \\'convincer\\' right before the lock comes off, nice adaptation.' - Tenyo Magic Forum user",
      "\"...this trick requires a lot of practice and training, both in terms of handling and staging because you must be really persuasive and natural so that your audience do not feel that something is wrong during the performance. Tenyo tricks which require a large training are very rare, so it is important to note that this is the case for Lucifer's Lock.\" - Tenyo Magic Blogspot",
      "\"Lucifer's Lock: Very nice and convincing way to get an ungimmicked lock off a rope.\" - Genii Forum user"
    ],
    "consensus": "The general consensus is that Lucifer's Lock is a clever and visually convincing trick, but it is also considered difficult to master, requiring significant practice to perform smoothly and naturally."
  },
  {
    "product_code": "T-197",
    "name": "X-Ray File",
    "description": "A card is freely selected and placed by a spectator into an envelope, making it impossible to see from the outside. Despite this, the magician can accurately name the card. This can be repeated with multiple cards, and the trick requires no practice, giving the illusion of X-ray vision.",
    "year_released": "2000",
    "creator": "Toru Suzuki",
    "popularity_score": 9,
    "rarity_score": 3.3,
    "combined_score": 6.15,
    "image_filename": "T-197_X-Ray_File.jpg",
    "reviews": [
      "'I love the look and function of this one, it feels like a genuine piece of spy gear.' - SimonC, Tenyo Magic Forum",
      "'I like this trick but you guys are right, it\\'s \\'dull\\', there are other ways to reveal a chosen card.' - David DeTenyo, Tenyo Magic Forum",
      "'i love mentalism tricks but this item didn\\'t amaze me much,can\\'t perform surrounded by spectators.' - Jaime C., Tenyo Magic Forum"
    ],
    "consensus": "The general consensus is that the trick has a clever method and a cool 'spy gear' aesthetic, but the routine is considered dull and not very engaging for spectators. It is also noted that the trick is not suitable for performance when surrounded."
  },
  {
    "product_code": "T-220",
    "name": "Crash Dice",
    "description": "A single die is placed in a clear container. Seconds later, it explodes into eight tiny dice or changes color. The props can be examined afterward.",
    "year_released": "2005",
    "creator": "Hiroshi Sawa",
    "popularity_score": 8,
    "rarity_score": 4,
    "combined_score": 6.0,
    "image_filename": "T-220_Crash_Dice.jpg",
    "reviews": [
      "'For starters, it's the perfect illusion for beginners. Totally self-working. BUT, if you make some SMALL changes, it can be great for PROs too.' - Penguin Magic reviewer",
      "'Yes, Tenyo's version is by the far the most well made.' - Tenyo Magic Forum member",
      "'If you have a younger magician, this is a great one to get as the setup is easy and the execution is fantastic.' - theory11 forum member"
    ],
    "consensus": "The general consensus is that \"Crash Dice\" is a visually appealing and easy-to-perform trick, making it great for beginners and younger magicians. While the cleanup can be challenging, the quality of the Tenyo product is considered to be the best."
  },
  {
    "product_code": "T-194",
    "name": "Mind Spinner",
    "description": "You show your audience a 4-inch tube which is printed with various card numbers and suits on its surface. When you spin the tube on the table, the numbers and suits become mixed up in a blur of colors. Next, you ask a spectator to select and remember one card from a deck of cards. When you spin the tube on the table again, your audience will be able to see the selected card mysteriously appear!",
    "year_released": "1999",
    "creator": "Michael Sibbernsen",
    "popularity_score": 4,
    "rarity_score": 7,
    "combined_score": 5.5,
    "image_filename": "T-194_Mind_Spinner.webp",
    "reviews": [
      "'This is another item I have used one time, and one time only. But it didn't work. Although the principle behind it is very cool, there are a few problems: - it is not very easy to spin the tubes properly so the illusion works (the video I linked to shows how to do it); - even if it works, it's pretty hard to see, it more or less works for people with good eyesight; (this was the case with my performance, they just didn't see it, even after a few attempts - take in mind I DID see it, so I (more or less) did it the proper way ...) - there is only one outcome, so non repeatable. I'm giving this one my lowest score yet, a 3. But for some people it might work, a nice routine/a good story, ... may elevate this optical illusion above an average illusion.' - David DeTenyo, Tenyo Magic Forum",
      "'Michael Sibbernsen\\'s \"Mind Spinner\" is one of the strangest revelations of a chosen card I\\'ve ever seen. A thick white plastic tube three and a half inches long, wich has black and red numerales and suit pips all over it, is spun on the table. All the printed images blur. After the spectator select a card from a deck, the tube is spun again and a spectator staring directly down on it from above will clearly see, amid the spinning blur, the numeral 3 and a diamond pip. In fact the selected card mysteriously appear. The effect is really magical because the revelation appears like a hologram, and despite the very rapid movement of the tube, pictures appear very clearly and remain stable in the air. This fascinating optical trick is reminiscent of optical toys produced in the late 1800s. It does, however, take a real knack to get the tube to spin properly. In addition, the tube can be examined by the spectator, he may even try to turn the tube but it will never reproduce the appearance of the playing card.' - tenyo-magic.blogspot.com",
      "'Yeah this got my lowest mark yet. It's a cool principal, and I think it'd work well in a pub but I've not performed more than once I don't think. I sure there's a better way to use the principal too, perhaps with some sort of abstract pattern which becomes an image. I have to say it looks really cool in my magic cabinet tho. Perhaps I'll get a second set and use them as napkin rings at my next dinner' - SimonC, Tenyo Magic Forum"
    ],
    "consensus": "The general consensus on Tenyo's Mind Spinner is that it is a clever optical trick with a fascinating principle, but it is difficult to perform effectively. Many users report that it takes a lot of practice to spin the tube correctly, and even then, the effect can be hard for spectators to see. While some appreciate its uniqueness and the holographic-like appearance of the revealed card, others find it impractical for performance and better suited as a collector's item or a novelty."
  },
  {
    "product_code": "T-84",
    "name": "Card Frame",
    "description": "A photograph, playing card, or a business card—anything set into this frame can be made to vanish. But, it can be easily restored to its original state once again. An elaborate gimmick is built within the frame, which performs the magic automatically. This convenient magic trick requires no setup and can be instantly repeated.",
    "year_released": "1977",
    "creator": "Shigeru Sugawara",
    "popularity_score": 7,
    "rarity_score": 3,
    "combined_score": 5.0,
    "image_filename": "T-84_Card_Frame.jpg",
    "reviews": [
      "'A photograph, playing card, or a business card—anything set into this frame can be made to vanish. But, don't worry, it can be easily restored to its original state once again. An elaborate gimmick is built within the frame, which performs the magic automatically. Very fine and convenient magic, requiring no setup and can be instantly repeated.' - tenyo-magic.blogspot.com",
      "'An elaborate gimmick is built within the frame, which performs the magic automatically. Very fine and convenient magic, requiring no setup and can be instantly repeated.' - Martin's Magic",
      "'Those who have seen a card frame will be puzzled by that. Also there is no \"forceful insertion\" of a card necessary to release the gimmick.' - funstuffonly.com Tenyo Magic Forum"
    ],
    "consensus": "The general consensus is that the Tenyo T-84 Card Frame is a clever and convenient trick with a well-designed, automatic gimmick. It is considered a classic Tenyo item that is easy to perform and instantly repeatable."
  },
  {
    "product_code": "T-137",
    "name": "Bolted!",
    "description": "Two plastic panels and a playing card all have a hole through their center. The card is sandwiched between the two panels and the whole thing is fastened together with a bolt and nut. The card mysteriously escapes!",
    "year_released": "1988",
    "creator": "Atsushi Fukano",
    "popularity_score": 6.5,
    "rarity_score": 3.3,
    "combined_score": 4.9,
    "image_filename": "T-137_Bolted.jpg",
    "reviews": [
      "'I have bolted but have never performed it for anyone because I am not impressed with the gimmick,not that its bad but takes some practice.' - MerlinsMagicShopMike, Tenyo Magic Forum",
      "'This is one of those very, very clever Tenyo tricks a lot of people, including me, only start performing when you see it performed as it should. And you did it! Once more you make me realize what great items I have in my collection but actually never perform... until now :) With this video I think Bolted will become a very collectible and highly sought after item in the future.' - @tenyobe, YouTube",
      "'Two plastic panels and a playing card all have a hole through their center. The card is sandwiched between the two panels and the whole thing is fastened together whit a bolt and nut. The card mysteriously escapes ! Move over Houdini ! Whit this great new magic trick, you will fool everyone. The secret is in the ingenious apparatus supplied whit this trick.' - tenyo-magic.blogspot.com"
    ],
    "consensus": "The general consensus is that Tenyo's \"Bolted!\" is a clever trick with an ingenious gimmick, but it requires practice to perform smoothly and avoid suspicion. While some find it impressive, others have never performed it due to the practice required. It is considered a collectible item."
  },
  {
    "product_code": "T-103",
    "name": "Frame Of Destruction",
    "description": "The magician borrows a bill, places it in a clear plastic frame, and puts the frame in an envelope. A pencil is then pushed through the envelope and frame. When the frame is removed, the bill is completely unharmed, even though the pencil clearly penetrated the frame.",
    "year_released": "1980",
    "creator": "Shigeru Sugawara",
    "popularity_score": 6,
    "rarity_score": 3,
    "combined_score": 4.5,
    "image_filename": "T-103_Frame_Of_Destruction.jpg",
    "reviews": [
      "'A wonderful effect from Tenyo’s prime.' - Presenting Tenyo on YouTube",
      "'I find it to be very clever but it will take a decent amount of practice to do smoothly. The only issue is that I find that the gimmick tends to get scratched up with use so I don’t use mine very much.' - Elliot W. on Tenyo Magic Forum",
      "'This astounding effect is based upon a brand new principle. Even professional magicians are dumbfounded, because everything can be examined. Also, no sleight of hand is required. The secret is totally simple, brillant and devastatingly deceptive principle.' - tenyo-magic.blogspot.com"
    ],
    "consensus": "The general consensus is that Tenyo's Frame of Destruction is a clever and deceptive trick that can fool even knowledgeable magicians. It is considered easy to perform and well-made, though some find the gimmick can be prone to scratching with use."
  }
]